In [7]:
import pandas as pd
import numpy as np

## Create a DataFrame

### From Numpy Array

In [5]:
dates = pd.date_range('today', periods=6) #Define time sequence as index
dates

DatetimeIndex(['2019-03-22 16:10:56.415987', '2019-03-23 16:10:56.415987',
               '2019-03-24 16:10:56.415987', '2019-03-25 16:10:56.415987',
               '2019-03-26 16:10:56.415987', '2019-03-27 16:10:56.415987'],
              dtype='datetime64[ns]', freq='D')

In [6]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [10]:
num_arr = np.random.randn(6,4)
num_arr

array([[-1.45395101, -1.49261135, -0.02446718,  0.3128067 ],
       [ 1.30267705, -1.34243697,  0.64191563,  0.62910517],
       [ 1.76337099,  1.1773015 , -0.84883379,  0.31063499],
       [ 1.16322082,  0.69062367,  0.00728429, -0.57609144],
       [-0.49133336,  0.00779357,  2.64920236,  1.02166848],
       [ 0.84277255, -1.30383716,  1.09760347, -0.89633954]])

In [16]:
columns = ['A','B','C','D']
DF1 = pd.DataFrame(num_arr,index=dates,columns=columns)
DF1

                                   A         B         C         D
2019-03-22 16:10:56.415987 -1.453951 -1.492611 -0.024467  0.312807
2019-03-23 16:10:56.415987  1.302677 -1.342437  0.641916  0.629105
2019-03-24 16:10:56.415987  1.763371  1.177302 -0.848834  0.310635
2019-03-25 16:10:56.415987  1.163221  0.690624  0.007284 -0.576091
2019-03-26 16:10:56.415987 -0.491333  0.007794  2.649202  1.021668
2019-03-27 16:10:56.415987  0.842773 -1.303837  1.097603 -0.896340

## From Dictionary

In [22]:
data = {'Animal':['Cat','Horse','Dog','Monkey','Cow'],
        'Age': [2,5,3,4,np.nan],
        'Visits':[1,2,1,3,2],
        'Priority':['Yes','No','Yes','No','Yes']}
labels = ['a','b','c','d','e']
DF2 = pd.DataFrame(data,index=labels)

In [23]:
print(DF2)

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [24]:
type(DF2)

pandas.core.frame.DataFrame

In [25]:
DF2.dtypes

Animal       object
Age         float64
Visits        int64
Priority     object
dtype: object

In [27]:
DF2.head(2)

  Animal  Age  Visits Priority
a    Cat  2.0       1      Yes
b  Horse  5.0       2       No

In [30]:
DF2.tail(-1)

   Animal  Age  Visits Priority
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [34]:
print(DF2.index)
print(DF2.columns)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Index(['Animal', 'Age', 'Visits', 'Priority'], dtype='object')

In [35]:
DF2.values

array([['Cat', 2.0, 1, 'Yes'],
       ['Horse', 5.0, 2, 'No'],
       ['Dog', 3.0, 1, 'Yes'],
       ['Monkey', 4.0, 3, 'No'],
       ['Cow', nan, 2, 'Yes']], dtype=object)

In [36]:
DF2.describe()

            Age   Visits
count  4.000000  5.00000
mean   3.500000  1.80000
std    1.290994  0.83666
min    2.000000  1.00000
25%    2.750000  1.00000
50%    3.500000  2.00000
75%    4.250000  2.00000
max    5.000000  3.00000

In [41]:
DF2.T

            a      b    c       d    e
Animal    Cat  Horse  Dog  Monkey  Cow
Age         2      5    3       4  NaN
Visits      1      2    1       3    2
Priority  Yes     No  Yes      No  Yes

In [43]:
DF2.sort_values(by='Age')

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
b   Horse  5.0       2       No
e     Cow  NaN       2      Yes

In [45]:
DF2

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [44]:
DF2[1:3]

  Animal  Age  Visits Priority
b  Horse  5.0       2       No
c    Dog  3.0       1      Yes

In [47]:
#Query the dataframe by tag
DF2[['Age','Visits']]

   Age  Visits
a  2.0       1
b  5.0       2
c  3.0       1
d  4.0       3
e  NaN       2

In [87]:
DF2

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [88]:
#Iloc

DF2.iloc[1:3]

  Animal  Age  Visits Priority
b  Horse  5.0       2       No
c    Dog  3.0       1      Yes

In [49]:
DF3 = DF2.copy()

In [50]:
DF3

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [53]:
DF3.isnull()

   Animal    Age  Visits  Priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False  False   False     False
e   False   True   False     False

In [54]:
DF3.loc['e','Age'] = 1.5
DF3

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  1.5       2      Yes

In [55]:
DF3.mean()

Age       3.1
Visits    1.8
dtype: float64

In [57]:
DF3['Visits'].sum()

9

In [58]:
#Strings

In [64]:
string = pd.Series(['Aa','Bb',np.nan,'Cc','Dd','Ee'])

In [66]:
string.str.upper()

0     AA
1     BB
2    NaN
3     CC
4     DD
5     EE
dtype: object

## Operations for DataFrame missing values

In [67]:
DF2

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes

In [68]:
DF4 = DF2.copy()

In [69]:
Mean = DF4.mean()

In [70]:
DF4.fillna(4)

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  4.0       2      Yes

In [71]:
DF5 = DF2.copy()

In [72]:
DF5.dropna(how='any')

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No

## DataFrame File Operations

In [75]:
DF2.to_csv('animal.csv')

In [76]:
DF_animal = pd.read_csv('animal.csv')

In [77]:
DF_animal

  Unnamed: 0  Animal  Age  Visits Priority
0          a     Cat  2.0       1      Yes
1          b   Horse  5.0       2       No
2          c     Dog  3.0       1      Yes
3          d  Monkey  4.0       3       No
4          e     Cow  NaN       2      Yes

In [85]:
del DF_animal['Unnamed: 0']

In [86]:
DF_animal

   Animal  Age  Visits Priority
0     Cat  2.0       1      Yes
1   Horse  5.0       2       No
2     Dog  3.0       1      Yes
3  Monkey  4.0       3       No
4     Cow  NaN       2      Yes

In [79]:
DF2.to_excel('animal.xlsx')

In [84]:
DF6 = pd.read_excel('animal.xlsx','Sheet1', index_col=None, na_values=['NA'])
DF6

   Animal  Age  Visits Priority
a     Cat  2.0       1      Yes
b   Horse  5.0       2       No
c     Dog  3.0       1      Yes
d  Monkey  4.0       3       No
e     Cow  NaN       2      Yes